Assignments/Assignment2/convertFahrenheitToKelvin-request.xml

<?xml version="1.0" ?>
<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    soap:encodingStyle="http://w3.org/2003/05/soap-encoding">

    <!-- omitted header element -->
    
    <soap:Body xmlns:xs="http://www.mockresources.io">
        <!-- request function -->
        <xs:tempConverting>
            <xs:function>convertFahrenheitToKelvin</xs:function>
            <xs:parameter>10.23</xs:parameter>
        </xs:tempConverting>
    </soap:Body>
</soap:Envelope>